@echo off  
setlocal enabledelayedexpansion  
  
echo ---------------------------------------------------------------
echo https://github.com/BILILICHENG/DRS-Clone-Png
echo ---------------------------------------------------------------
echo ---------------------------------------------------------------
echo 请将音乐文件夹【music】拖放至这里并且按下回车
echo ---------------------------------------------------------------
set /p input=

echo ---------------------------------------------------------------
echo 请将最终导出的文件夹拖放至这里并且按下回车
echo ---------------------------------------------------------------
set /p output=
  
:: 检查目标文件夹是否存在，如果不存在则创建  
if not exist "%output%" mkdir "%output%"  
  
:: 使用for /r循环遍历源文件夹及其子文件夹，搜索匹配的文件  
for /r "%input%" %%I in (jk_*_b.png) do (  
    echo Found: %%~nxi  
    copy "%%I" "%output%"  
)  
  
echo ---------------------------------------------------------------
echo 已全部执行成功！如果没问题的话请按下回车结束！
echo ---------------------------------------------------------------
pause
